In [43]:
import pandas as pd
from pyspark.sql import SparkSession

In [44]:
pdf = pd.read_csv('healthcare.csv')

In [45]:
pdf

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
...,...,...,...,...,...,...,...,...,...,...,...,...
5105,18234,Female,80.0,1,0,Yes,Private,Urban,83.75,NaN,never smoked,0
5106,44873,Female,81.0,0,0,Yes,Self-employed,Urban,125.20,40.0,never smoked,0
5107,19723,Female,35.0,0,0,Yes,Self-employed,Rural,82.99,30.6,never smoked,0
5108,37544,Male,51.0,0,0,Yes,Private,Rural,166.29,25.6,formerly smoked,0
5109,44679,Female,44.0,0,0,Yes,Govt_job,Urban,85.28,26.2,Unknown,0

In [46]:
from pyspark.sql.types import StringType,BooleanType,IntegerType,LongType,StructType,StructField

In [47]:
spark1 = SparkSession.builder.appName('shub').getOrCreate()

In [48]:
spark1

In [73]:
data = [
    (1, 'Shub', 50000, 'New York'),
    (2, 'Akshay', 60000, 'Los Angeles'),
    (3, 'Priya', 55000, 'Chicago'),
    (4, 'Ravi', 48000, 'San Francisco'),
    (5, 'Nisha', 70000, 'Boston'),
    (6, 'Amit', 65000, 'Miami'),
    (7, 'Sanya', 72000, 'Houston'),
    (8, 'Karan', 52000, 'Seattle')
]

In [78]:
sdf = spark1.createDataFrame(data,schema=['id','name','salary','city'])

In [79]:
sdf.show()

+---+------+------+-------------+
| id|  name|salary|         city|
+---+------+------+-------------+
|  1|  Shub| 50000|     New York|
|  2|Akshay| 60000|  Los Angeles|
|  3| Priya| 55000|      Chicago|
|  4|  Ravi| 48000|San Francisco|
|  5| Nisha| 70000|       Boston|
|  6|  Amit| 65000|        Miami|
|  7| Sanya| 72000|      Houston|
|  8| Karan| 52000|      Seattle|
+---+------+------+-------------+

In [82]:
sdf.select(['salary','city']).show()

+------+-------------+
|salary|         city|
+------+-------------+
| 50000|     New York|
| 60000|  Los Angeles|
| 55000|      Chicago|
| 48000|San Francisco|
| 70000|       Boston|
| 65000|        Miami|
| 72000|      Houston|
| 52000|      Seattle|
+------+-------------+

In [83]:
sdf.withColumn('bonus',sdf.salary * 0.5).show()

+---+------+------+-------------+-------+
| id|  name|salary|         city|  bonus|
+---+------+------+-------------+-------+
|  1|  Shub| 50000|     New York|25000.0|
|  2|Akshay| 60000|  Los Angeles|30000.0|
|  3| Priya| 55000|      Chicago|27500.0|
|  4|  Ravi| 48000|San Francisco|24000.0|
|  5| Nisha| 70000|       Boston|35000.0|
|  6|  Amit| 65000|        Miami|32500.0|
|  7| Sanya| 72000|      Houston|36000.0|
|  8| Karan| 52000|      Seattle|26000.0|
+---+------+------+-------------+-------+

In [84]:
from pyspark.sql.functions import current_date, date_format, to_timestamp, current_timestamp,lit,when

In [88]:
sdf.withColumn("update",date_format(current_date(),'mm-dd-yyyy')).show()

+---+------+------+-------------+----------+
| id|  name|salary|         city|    update|
+---+------+------+-------------+----------+
|  1|  Shub| 50000|     New York|00-30-2024|
|  2|Akshay| 60000|  Los Angeles|00-30-2024|
|  3| Priya| 55000|      Chicago|00-30-2024|
|  4|  Ravi| 48000|San Francisco|00-30-2024|
|  5| Nisha| 70000|       Boston|00-30-2024|
|  6|  Amit| 65000|        Miami|00-30-2024|
|  7| Sanya| 72000|      Houston|00-30-2024|
|  8| Karan| 52000|      Seattle|00-30-2024|
+---+------+------+-------------+----------+

In [101]:
hello = sdf.withColumn("update",date_format(current_date(),'MM-dd-yyyy')).show()

+---+------+------+-------------+----------+
| id|  name|salary|         city|    update|
+---+------+------+-------------+----------+
|  1|  Shub| 50000|     New York|09-30-2024|
|  2|Akshay| 60000|  Los Angeles|09-30-2024|
|  3| Priya| 55000|      Chicago|09-30-2024|
|  4|  Ravi| 48000|San Francisco|09-30-2024|
|  5| Nisha| 70000|       Boston|09-30-2024|
|  6|  Amit| 65000|        Miami|09-30-2024|
|  7| Sanya| 72000|      Houston|09-30-2024|
|  8| Karan| 52000|      Seattle|09-30-2024|
+---+------+------+-------------+----------+

In [103]:
hello.show()    # because show() is a triger to print,in-fact result is not assigned

AttributeError: 'NoneType' object has no attribute 'show'

In [104]:
hello = sdf.withColumn("update",date_format(current_date(),'MM-dd-yyyy'))

In [105]:
hello.show()

+---+------+------+-------------+----------+
| id|  name|salary|         city|    update|
+---+------+------+-------------+----------+
|  1|  Shub| 50000|     New York|09-30-2024|
|  2|Akshay| 60000|  Los Angeles|09-30-2024|
|  3| Priya| 55000|      Chicago|09-30-2024|
|  4|  Ravi| 48000|San Francisco|09-30-2024|
|  5| Nisha| 70000|       Boston|09-30-2024|
|  6|  Amit| 65000|        Miami|09-30-2024|
|  7| Sanya| 72000|      Houston|09-30-2024|
|  8| Karan| 52000|      Seattle|09-30-2024|
+---+------+------+-------------+----------+

In [110]:
sdf.withColumn("timestamp",to_timestamp(current_timestamp(),'dd-mm-yyyy hh:mm:ss')).show()

+---+------+------+-------------+--------------------+
| id|  name|salary|         city|           timestamp|
+---+------+------+-------------+--------------------+
|  1|  Shub| 50000|     New York|2024-09-30 11:50:...|
|  2|Akshay| 60000|  Los Angeles|2024-09-30 11:50:...|
|  3| Priya| 55000|      Chicago|2024-09-30 11:50:...|
|  4|  Ravi| 48000|San Francisco|2024-09-30 11:50:...|
|  5| Nisha| 70000|       Boston|2024-09-30 11:50:...|
|  6|  Amit| 65000|        Miami|2024-09-30 11:50:...|
|  7| Sanya| 72000|      Houston|2024-09-30 11:50:...|
|  8| Karan| 52000|      Seattle|2024-09-30 11:50:...|
+---+------+------+-------------+--------------------+

In [116]:
sdf_with_current_time = sdf.withColumn("Current_time",current_timestamp())

In [121]:
sdf_with_current_time.show()

+---+------+------+-------------+--------------------+
| id|  name|salary|         city|        Current_time|
+---+------+------+-------------+--------------------+
|  1|  Shub| 50000|     New York|2024-09-30 12:00:...|
|  2|Akshay| 60000|  Los Angeles|2024-09-30 12:00:...|
|  3| Priya| 55000|      Chicago|2024-09-30 12:00:...|
|  4|  Ravi| 48000|San Francisco|2024-09-30 12:00:...|
|  5| Nisha| 70000|       Boston|2024-09-30 12:00:...|
|  6|  Amit| 65000|        Miami|2024-09-30 12:00:...|
|  7| Sanya| 72000|      Houston|2024-09-30 12:00:...|
|  8| Karan| 52000|      Seattle|2024-09-30 12:00:...|
+---+------+------+-------------+--------------------+

In [122]:
sdf_with_age = sdf_with_current_time.withColumn('age',30)      # we use lit to add constant value like 30

TypeError: col should be Column

In [123]:
sdf_with_age = sdf_with_current_time.withColumn('age',lit(30))

In [125]:
sdf_with_age.show()

+---+------+------+-------------+--------------------+---+
| id|  name|salary|         city|        Current_time|age|
+---+------+------+-------------+--------------------+---+
|  1|  Shub| 50000|     New York|2024-09-30 12:05:...| 30|
|  2|Akshay| 60000|  Los Angeles|2024-09-30 12:05:...| 30|
|  3| Priya| 55000|      Chicago|2024-09-30 12:05:...| 30|
|  4|  Ravi| 48000|San Francisco|2024-09-30 12:05:...| 30|
|  5| Nisha| 70000|       Boston|2024-09-30 12:05:...| 30|
|  6|  Amit| 65000|        Miami|2024-09-30 12:05:...| 30|
|  7| Sanya| 72000|      Houston|2024-09-30 12:05:...| 30|
|  8| Karan| 52000|      Seattle|2024-09-30 12:05:...| 30|
+---+------+------+-------------+--------------------+---+

In [126]:
sdf_all = sdf_with_age

# create a view

In [127]:
sdf_all.createOrReplaceTempView('emp')

In [128]:
spark1.sql("select * from emp").show()

+---+------+------+-------------+--------------------+---+
| id|  name|salary|         city|        Current_time|age|
+---+------+------+-------------+--------------------+---+
|  1|  Shub| 50000|     New York|2024-09-30 12:11:...| 30|
|  2|Akshay| 60000|  Los Angeles|2024-09-30 12:11:...| 30|
|  3| Priya| 55000|      Chicago|2024-09-30 12:11:...| 30|
|  4|  Ravi| 48000|San Francisco|2024-09-30 12:11:...| 30|
|  5| Nisha| 70000|       Boston|2024-09-30 12:11:...| 30|
|  6|  Amit| 65000|        Miami|2024-09-30 12:11:...| 30|
|  7| Sanya| 72000|      Houston|2024-09-30 12:11:...| 30|
|  8| Karan| 52000|      Seattle|2024-09-30 12:11:...| 30|
+---+------+------+-------------+--------------------+---+

In [135]:
spark1.sql('select * from emp where salary > 50000').show()

+---+------+------+-----------+--------------------+---+
| id|  name|salary|       city|        Current_time|age|
+---+------+------+-----------+--------------------+---+
|  2|Akshay| 60000|Los Angeles|2024-09-30 12:14:...| 30|
|  3| Priya| 55000|    Chicago|2024-09-30 12:14:...| 30|
|  5| Nisha| 70000|     Boston|2024-09-30 12:14:...| 30|
|  6|  Amit| 65000|      Miami|2024-09-30 12:14:...| 30|
|  7| Sanya| 72000|    Houston|2024-09-30 12:14:...| 30|
|  8| Karan| 52000|    Seattle|2024-09-30 12:14:...| 30|
+---+------+------+-----------+--------------------+---+

In [148]:
sdf_all.withcolum("bonus",when(sdf_all.salary > 55000, "high").otherwise("low")).show()

AttributeError: 'DataFrame' object has no attribute 'withcolum'

In [147]:
sdf_all.withColumn("bonus",when(sdf_all.salary > 55000, "high").otherwise("low")).show()

+---+------+------+-------------+--------------------+---+-----+
| id|  name|salary|         city|        Current_time|age|bonus|
+---+------+------+-------------+--------------------+---+-----+
|  1|  Shub| 50000|     New York|2024-09-30 12:28:...| 30|  low|
|  2|Akshay| 60000|  Los Angeles|2024-09-30 12:28:...| 30| high|
|  3| Priya| 55000|      Chicago|2024-09-30 12:28:...| 30|  low|
|  4|  Ravi| 48000|San Francisco|2024-09-30 12:28:...| 30|  low|
|  5| Nisha| 70000|       Boston|2024-09-30 12:28:...| 30| high|
|  6|  Amit| 65000|        Miami|2024-09-30 12:28:...| 30| high|
|  7| Sanya| 72000|      Houston|2024-09-30 12:28:...| 30| high|
|  8| Karan| 52000|      Seattle|2024-09-30 12:28:...| 30|  low|
+---+------+------+-------------+--------------------+---+-----+

In [ ]:
sdf_all.withColumn('relation',when(sdf_all.name.startswith('A') | sdf_all.name.startswith('S')